[
  {
    "Position": "1",
    "User Name": "",
    "Date": "",
    "Title": "I am changing 3 of my clients web sites to POSTX",
    "Review": "Hi, Glad I got this at the last minute. I have just converted 3 client sites to PostX and they love it. It suites their model better. I still have some static landing pages, but if you have a lot of content, POSTX does the hard work for you. I had refunded it before, but I did not have , or I thought I did not have a use case. I am glad it came back as it is worth every dollar.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/MyPhoto.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/i-am-changing-3-of-my-clients-web-sites-321041/",
    "Rating": "5 stars"
  },
  {
    "Position": "2",
    "User Name": "",
    "Date": "",
    "Title": "Purchased it",
    "Review": "I previously bought postX and utilized it for several months. With this tool, I no longer require any additional premium themes or design plugins. I'm currently using the free theme without any other design plugins. It's straightforward and user-friendly; all you have to do is select a design and save it. Having had a positive experience with postX, I decided to purchase their other tools as well. If you check out one of my websites, you'll see how I implemented it. theuniverseepisodes.com\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/2_XxyzRv1.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/purchased-it-320209/",
    "Rating": "5 stars"
  },
  {
    "Position": "3",
    "User Name": "",
    "Date": "",
    "Title": "Great product",
    "Review": "I have to admit, I did purchase the PostX plugin previously, but honestly, I found it a bit complicated to use it. So, I decided to refund it. But this time, after reading some positive reviews, I decided to give it another shot. I found the plugin very user-friendly and packed with great features that enhanced the building of my sites. I’m glad I invested, and it’s definitely a keeper in my toolkit,",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/SmartSelect_20210920-112435_Gallery_jYvrxec.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/great-product-319997/",
    "Rating": "5 stars"
  },
  {
    "Position": "4",
    "User Name": "",
    "Date": "",
    "Title": "Quick design solution + Great Support",
    "Review": "To be quite honest, I'm no developer and cant do HTML/CSS editing. This plugin made life so simple with creating Websites.\n\nThere are many ready to made templates (which are quite good for news, Magazine and other themes) but it gave me real flexibility/ease to create the design I had in mind ... (you might say all is possible in default WP... yes its possible but this plugin made the things very easy and simple)\n\nOn top of that I would like to highlight the support provided by the team to my queries was really good. They were knowledgeable and very helpful.\n\nThats all I need from the tool.\n\nI would love to see more templates from them in future..\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/e2883d7f6e1ab7878f00f404a4698fb8?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/quick-design-solution-great-support-265496/",
    "Rating": "5 stars"
  },
  {
    "Position": "5",
    "User Name": "",
    "Date": "",
    "Title": "A Game-Changer for Content Marketers",
    "Review": "Let me start by saying, I rarely write reviews. But when a product like PostX comes along, it demands to be praised. I’ve been using their service prior to their AppSumo campaign, and when I saw them featured there, I didn’t hesitate to go all-in.\n\nWhy, you ask?\n\nSimply put, PostX is a massive time-saver. With just a few clicks, you can create a stunning, professionally-designed, and optimized blog or content website. The themes are stylish, minimalist, and modern.\n\nI remember the days when I had to spend weeks tweaking the Generatepress theme to make it work well for my content site. And don’t even get me started on the number of additional plugins I had to install! But with PostX, those days are long gone.\n\nI know what you might be thinking: “What about Elementor?”\n\nYes, I’m very familiar with Elementor, but content websites need to be optimized for speed. Elementor can be overwhelming and can significantly slow down your site if you aren’t careful. And honestly, who has the time these days to build a website block by block?\n\nI’ve built dozens of websites with various themes and editors. So trust me when I say, PostX is different. I’ve measured my website’s speed score with both Elementor and PostX, and the latter came out on top.\n\nThe support from the PostX team has been top-notch.\n\nThey’ve helped me several times, always in a professional manner. What’s even more amazing is that they’re a team of developers from Bangladesh. It’s wonderful to see talent from my home country shining on a global stage, especially on platforms like AppSumo. Thanks to other Bangladeshi developers on Appsumo: Academy LMS, REOON, and Dark My Site.\n\nDespite numerous barriers such as English not being our primary language, lack of international payment gateways, and minimal support from local administration, our developers are providing top-tier services on an international scale.\n\nTo sum up, if you’re involved in SEO or content marketing and want to create an outstanding blog website, PostX is a must-have.\n\nAnd the best part?\n\nYou don’t even need a paid theme - a simple free Generatepress or Hello theme works perfectly fine with PostX. That’s another plus in my book for cost-saving!\n\nTrust me, I’ve been in your shoes before. PostX is truly a game-changer.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/1cc1246f554e5813c66f5b6dda5aaea5?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/a-game-changer-for-content-marketers-265067/",
    "Rating": "5 stars"
  },
  {
    "Position": "6",
    "User Name": "",
    "Date": "",
    "Title": "Perfect builder + support",
    "Review": "I really love how hands on this builder is and the support is epic.\nI had a problem, as I am not a experience techie myself by adjusting the screen to mobile to have the perfect fit.\nBut within 5 minutes the support helped me. It was not a technical issue, but still they helped me anyways.",
    "Avatar": "https://www.gravatar.com/avatar/7cb265b0981415897a85fc60a3c1ea4c?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/perfect-builder-support-264757/",
    "Rating": "5 stars"
  },
  {
    "Position": "7",
    "User Name": "",
    "Date": "",
    "Title": "Fantastic",
    "Review": "Guys, I honestly love your product. I had purchased it about 1,5y ago and refunded it for a few bugs and things I got annoyed, which was an easy process. I then came back a few months later as I needed a solution for a quick blog, started using the free version and found my way around the pro. I would lie if I didn't think every time when I had to work it, that I want to get the pro. Well, I found it here, and it's just amazing.\n\n5 Tacos all the way for a real time saver, please keep it up. Thanks!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/IMG_0305.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/fantastic-264702/",
    "Rating": "5 stars"
  },
  {
    "Position": "8",
    "User Name": "",
    "Date": "",
    "Title": "Quick design upgrade for ugly blogs",
    "Review": "I have a bunch of in-house blog sites with feeds. They are pretty basic since we didn't want to spend alot on design for these. I just plugged in PostX, a few setting checks and voila!! Pretty 😍 and worth every penny to me, thank you!!",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/GM_Avatar.png?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/quick-design-upgrade-for-ugly-blogs-264693/",
    "Rating": "5 stars"
  },
  {
    "Position": "9",
    "User Name": "",
    "Date": "",
    "Title": "postx is the king",
    "Review": "wow! it does exactley what i need and even more works like a charm i home there will be a cool future updates",
    "Avatar": "https://www.gravatar.com/avatar/f477a4fff13a785d8358c6b74f33d38f?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/postx-is-the-king-264193/",
    "Rating": "5 stars"
  },
  {
    "Position": "10",
    "User Name": "",
    "Date": "",
    "Title": "Excellent",
    "Review": "This is the first time I've been able to create a website, even after trying so many other tools and plugins. I'm a complete novice with zero prior knowledge about website design. However, with the help of the PostX plugin, the process became highly functional and intuitive. The vast customization options and preset formats it offers are truly commendable. It allowed me to effortlessly enhance my website. A big thank you to PostX and AppSumo for making this possible!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/1e918b8ebf1634b06e56df830877c035?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/excellent-263482/",
    "Rating": "5 stars"
  },
  {
    "Position": "11",
    "User Name": "",
    "Date": "",
    "Title": "WPXPO Progress Bar Issue Solved",
    "Review": "I had an issue with the progress bar on my site but Tonmoy helped me to solve the issue!\n\nHe was very helpful!",
    "Avatar": "https://www.gravatar.com/avatar/4c7294b4fd9935b1954a65d699043b96?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/wpxpo-progress-bar-issue-solved-262262/",
    "Rating": "5 stars"
  },
  {
    "Position": "12",
    "User Name": "",
    "Date": "",
    "Title": "Took a bit of time to figure out but once you do, wow.",
    "Review": "Took me a while to figure it out - it's a plugin but really functions like Elementor/template. You have to download the plugin AND PostX plugin from plugings - it won't work without it. It creates whole pages that will commandeer your front page at first until you realize how to use it (I wanted it to create whole pages for me, but realized it does the same with design blocks in the back own without taking over homepage). It just works immediately. Now thinking about designing a whole site based on it.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/WhatsApp_Image_2023-01-21_at_2.55.14_PM.jpeg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/took-a-bit-of-time-to-figure-out-but-onc-262135/",
    "Rating": "5 stars"
  },
  {
    "Position": "13",
    "User Name": "",
    "Date": "",
    "Title": "Excellent",
    "Review": "Just what I was looking for. It is easy to edit your pages for a novice like me. Gives plenty of options and I haven't scratched the surface yet.\n\nLove it.\n\nHowever, would be nice to not have the postx blocks inserted in the templates. Deleting them seems ridiculous for a paid plugin.",
    "Avatar": "https://www.gravatar.com/avatar/73b74e2d8c486a9152ca01beb566e6ff?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/excellent-260834/",
    "Rating": "5 stars"
  },
  {
    "Position": "14",
    "User Name": "",
    "Date": "",
    "Title": "Fantastic",
    "Review": "I was already an existing user of PostX and have used it on many sites to make homepages. But now, with the Pro, I plan to make almost the whole site on it. And so glad to see the custom template feature on this plugin, which I never expected of it. My old clients are happy, too as I upgraded them to pro and referred me to a few new ones.",
    "Avatar": "https://www.gravatar.com/avatar/d88ae9dc10dacc31a525fc189240f955?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/fantastic-260472/",
    "Rating": "5 stars"
  },
  {
    "Position": "15",
    "User Name": "",
    "Date": "",
    "Title": "Terrific Gutenberg builder",
    "Review": "great for blogs/magazines",
    "Avatar": "https://www.gravatar.com/avatar/ed495ab6e638090378fc7b16f69b0f80?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/terrific-gutenberg-builder-260444/",
    "Rating": "5 stars"
  },
  {
    "Position": "16",
    "User Name": "",
    "Date": "",
    "Title": "Great plugin for wp magazine sites",
    "Review": "I tried postx and its great for blogs, I fully recomend it for optimize the design work and profesional presentation.",
    "Avatar": "https://www.gravatar.com/avatar/3a62411e8e904df06b1f55a17870271c?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/great-plugin-for-wp-magazine-sites-260432/",
    "Rating": "5 stars"
  },
  {
    "Position": "17",
    "User Name": "",
    "Date": "",
    "Title": "Easy Peasy",
    "Review": "PostX gives me the drag and drop ability to customise and style my blog sites. It really is as simple as they say it is. I find the range of blocks to suit most of my needs. I also made a request for Bricks builder integration and 2 weeks later they pushed that feature out. Looking forward to see what else they can do. Worth the purchase price.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/21ee80b54010fec612739a3cb2d0942f.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/easy-peasy-260429/",
    "Rating": "5 stars"
  },
  {
    "Position": "18",
    "User Name": "",
    "Date": "",
    "Title": "Great addition",
    "Review": "As I am creating a magazine style website, this is just what I needed. One of my favorite parts is the Table of Contents and the ability to reference previously written posts. This make the entire experience so much more rich and engaging and less of looking like a typical website.",
    "Avatar": "https://www.gravatar.com/avatar/5a55ce45f3c5da60adfa02244f1ad96f?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/great-addition-260362/",
    "Rating": "5 stars"
  },
  {
    "Position": "19",
    "User Name": "",
    "Date": "",
    "Title": "A User’s Delight",
    "Review": "Having recently acquired PostX, I am compelled to share my delightful experience. This dynamic site builder for WordPress is a game-changer, especially for news, magazine, and blog site creators.\n\nThe Gutenberg blocks, with their diverse design variations, make post display a breeze - a testament to the thoughtfulness that went into creating this tool. The addition of 300+ patterns in the Starter Packs is a boon, offering a jump-start to site creation.\n\nWhat truly stands out is the Dynamic Site Builder. It’s a time-saver, assisting in creating all essential pages effortlessly.\n\nThe seamless integration with Elementor and SEO plugins like Yoast and Rank Math showcases the versatile nature of PostX. The Query Builder is another impressive feature, allowing flexible post display based on categories, tags or user engagements.\n\nThe typography control and custom font uploading option add to the user-friendly nature of PostX, providing customization that matches your website’s style. The addition of dynamic sliders and carousels further enhances the aesthetic appeal.\n\nMy appreciation extends to the responsive and helpful support team. They are proactive and quick to assist, making the overall experience even better.\n\nIn conclusion, based on my user experience, I wholeheartedly recommend PostX. It’s not just a product, it’s a comprehensive solution for site-building. Don’t just take my word for it, give PostX a try and see the difference yourself!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/f73b26250722af76ca444697c43c1d2e?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/a-users-delight-260155/",
    "Rating": "5 stars"
  },
  {
    "Position": "20",
    "User Name": "",
    "Date": "",
    "Title": "Just... Amazing",
    "Review": "I absolutely love how easy it is to use. I use Divi as my main page builder but I have always used Gutenburg for my posts. PageX crosses the divide seamlessly. My Multi-category archives and pages can be designed with ease. I am able to do things out of the box that would have taken a long time for me to learn to do with Divi, or may have needed additional market place purchases.\n\nI think PageX is going to be up there as one of my best ever purchases from AppSumo.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Susan_Pearson_looking_whimsical.png?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/just-amazing-259088/",
    "Rating": "5 stars"
  },
  {
    "Position": "21",
    "User Name": "",
    "Date": "",
    "Title": "This is hands down the #1 blog page plugin!",
    "Review": "Been trying a handful of blog layout plugins and always on the lookout for one that can create professionally looking blog archive page ... until I stumbled upon PostX ... in fact, I just demonstrated to my friend today how I converted a vanilla Hello World WordPress blog to a visually stunning professional layout blog page in just a couple of minutes! Getting the Tier 2 is an easy choice for me ... definitely 5 tacos!",
    "Avatar": "https://www.gravatar.com/avatar/cc8235e27ee35d98506a69c1f9b6397f?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/this-is-hands-down-the-1-blog-page-plug-258783/",
    "Rating": "5 stars"
  },
  {
    "Position": "22",
    "User Name": "",
    "Date": "",
    "Title": "Customize web pages easily",
    "Review": "Experience with product: I’ve been using PostX for a little more than a year now.\n\nEase of use: PostX makes it easy for even beginners to customize the layout of posts and pages. It works with every theme we’ve tried it with. It’s the fastest way that I’ve seen to get a post looking the way I want without having to code or find a template. If you aren’t sure of what layout you want, the program gives you pre-built options.\n\nGlitches: None so far. I expected it to slow our site speeds down, but it didn’t.\n\nValue: PostX is useful for anyone who wants to customize the layout of individual web pages or blog posts quickly. You know how when you see a layout you often want to try to copy it? PostX is a tool that lets you find the element you like and add it to a post.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/db5eca09982f7b19dfebe9ef07fbf00d?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/customize-web-pages-easily-258706/",
    "Rating": "5 stars"
  },
  {
    "Position": "23",
    "User Name": "",
    "Date": "",
    "Title": "Gottfried",
    "Review": "A great Plugin for complex blogs and newspaper websites, It makes the layout of such sites really much simpler.\n\nWorks well together with Stackable and Blocksy template.\n\nAnd, especially, the support is professional and quick, and you get answers mostly within a very short time.",
    "Avatar": "https://www.gravatar.com/avatar/ed5caf7dd6f5bfd8bee583596dfadef7?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/gottfried-258689/",
    "Rating": "5 stars"
  },
  {
    "Position": "24",
    "User Name": "",
    "Date": "",
    "Title": "A Stellar Gutenberg Plugin for WP",
    "Review": "PostX is an incredible gutenberg block plugin. Makes website design an absolute snap.\n\nPostX is compatible with Stackable and other gutenberg builders too so the sky's the limit. Very adaptable.\n\nI'm going to use PostX to develop affiliate product review websites next.\n\nJust amazing!",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/David.Eyler._Selfie_2.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/a-stellar-gutenberg-plugin-for-wp-258026/",
    "Rating": "5 stars"
  },
  {
    "Position": "25",
    "User Name": "",
    "Date": "",
    "Title": "Underwhelming",
    "Review": "Underwhelming! Key feature not included basically limited basic function possible better if you upgrade not sure. I refunded. Better Gutenberg block options out there.",
    "Avatar": "https://www.gravatar.com/avatar/ceee782d5bb62b58639a50e0df5e88c8?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/underwhelming-257861/",
    "Rating": "2 stars"
  },
  {
    "Position": "26",
    "User Name": "",
    "Date": "",
    "Title": "Design Blog sites in just minutes",
    "Review": "PostX is a powerful WordPress plugin that simplifies the process of building news, magazine, and blog sites.\n\nWith its extensive template library and customizable blocks, creating visually appealing webpages becomes effortless.\n\nThe ability to organize content efficiently and integrate with popular site builders makes it even more convenient.\n\nWhether you’re a beginner or an experienced user, PostX offers the features you need to launch your website in record time.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/883d9442593eda29ee13a7c0b5c84214?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/design-blog-sites-in-just-minutes-257860/",
    "Rating": "5 stars"
  },
  {
    "Position": "27",
    "User Name": "",
    "Date": "",
    "Title": "Just WOOOW!",
    "Review": "This is my first purchase on Appsumo, although I have looked at some offers from time to time before.\nBut when I saw the PostX offer, I didn't think twice!\nI have been using the free version of this plugin for a long time and I am fascinated by it.\nBelieve me, there is no other plugin for Wordpress, based on Gutenberg blocks, that would offer at least similar functionality as PostX.\nThanks to the PostX plugin, you can create a high-class magazine, news portal, and advanced blog from any WordPress theme, which will not be inferior in appearance and functionality to world-famous news portals websites.\n\nIn addition, it is worth mentioning that the developer is very active and new functionalities are systematically implemented.\n\nThis is not an ordinary plug.\nIt's a powerful system that will help you build amazing websites.\n\nThanks you so much for this amazing offer!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/d508b1653847fcd42efc618b9568f527?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/just-wooow-257612/",
    "Rating": "5 stars"
  },
  {
    "Position": "28",
    "User Name": "",
    "Date": "",
    "Title": "WOW !",
    "Review": "It is a magical casket to be discovered with which to play and have fun, as well as a potential investment. Thanks Appsumo for bringing it to us. They have outstanding support and work with Stackable. Grazieee!! Ciao",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/logo_fiorenzo.jpeg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/wow-257501/",
    "Rating": "5 stars"
  },
  {
    "Position": "29",
    "User Name": "",
    "Date": "",
    "Title": "Wonderful plugin",
    "Review": "Nice Plugin and Great Support. Thanks",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/barna-bartis-2x3vfVxwR7o-unsplash_Q6kEWTe.jpg?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/wonderful-plugin-257258/",
    "Rating": "5 stars"
  },
  {
    "Position": "30",
    "User Name": "",
    "Date": "",
    "Title": "Impressive Functionality and Unparalleled Support with PostX",
    "Review": "Having tried numerous WordPress plugins, I can confidently state that PostX has set a new standard. Its versatility and efficiency are incomparable.\n\nUnparalleled Flexibility:\nPostX offers an extensive range of customization options for News blog layouts. Whether you prefer a grid, list, or slider layout, the plugin caters to all. You can easily modify column sizes, content elements, typography, and colours according to your needs.\n\nUser-Friendly Interface:\nThe user interface is intuitive and straightforward. Regardless of your technical expertise level with WordPress, you will find it easy to use. The drag-and-drop feature particularly enhances the experience for those less technically inclined.\n\nEfficient Performance:\nOne of the most remarkable aspects of PostX is its smooth performance. It does not slow down your website despite offering rich features and functionalities.\n\nExcellent Support Team:\nThe support team deserves recognition as well. They have been extremely responsive and helpful whenever I encountered any issues or had queries about the plugin’s functionalities.\n\nRegular Updates:\nI appreciate their commitment to constant improvements with regular updates that introduce new features while improving existing ones. They clearly listen to user feedback and strive to cater to their needs better.\n\nI highly recommend PostX for anyone looking at stepping up their WordPress game. It’s an investment worth making!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/f7b57f379d5e97b0f37d4cfc4b0ecf2e?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/impressive-functionality-and-unparallele-257175/",
    "Rating": "5 stars"
  },
  {
    "Position": "31",
    "User Name": "",
    "Date": "",
    "Title": "Great Customer service!!!",
    "Review": "Had an issue with my blog and messaged the live chat and got a response within a few seconds, outstanding customer service!\nThis is super easy to use, with loads of beautifully ready-made templates and saves so much time from having to create everything manually, especially when building loads of websites for clients.\nwould 10/10 recommend. 5 tacos from me!",
    "Avatar": "https://www.gravatar.com/avatar/4a821a82d8225ace048c5a6928cc52fd?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/great-customer-service-257158/",
    "Rating": "5 stars"
  },
  {
    "Position": "32",
    "User Name": "",
    "Date": "",
    "Title": "Thank you!!!",
    "Review": "I have been watching PostX for quite some time and this could not have come at a better time. I have explored every option out there for maximizing the potential of Gutenberg and when it comes to crafting gorgeous layouts and my favorite and highlight of the tool Single Posts, nothing compares to PostX. You can tell the care and time that has been put into developing this so it should be an instant buy for anyone who is dedicated to using Gutenberg. Thank you PostX Team!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/EFFB_1.png?width=150",
    "Review Link": "https://appsumo.com/products/postx/reviews/thank-you-256992/",
    "Rating": "5 stars"
  },
  {
    "Position": "33",
    "User Name": "",
    "Date": "",
    "Title": "Great Customer Service! Great Product!",
    "Review": "Excellent customer service from Tonmoy! I can see why PostX Pro is rated the #1 Gutenberg WordPress plugin.",
    "Avatar": "https://www.gravatar.com/avatar/ff53efea338574104ec58a19526c8180?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/great-customer-service-great-product-256975/",
    "Rating": "5 stars"
  },
  {
    "Position": "34",
    "User Name": "",
    "Date": "",
    "Title": "Easy to Use",
    "Review": "I am using Kadence theme and the post loop blocks they offer are good but I have a hard time getting them to look how I want them. This plugin made it super easy to get posts to look exactly how I want. There are a ton of options and I can customize just about every detail. The starter packs look really good and make it easy to just import a whole page that is nicely designed in seconds.",
    "Avatar": "https://www.gravatar.com/avatar/5361f19b9aa4c24589c51f9539c28933?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/easy-to-use-256961/",
    "Rating": "5 stars"
  },
  {
    "Position": "35",
    "User Name": "",
    "Date": "",
    "Title": "Easiest 'Builder' for your blog need!",
    "Review": "I used many different page builder WPBakery, Stackable, etc... and most recently Greenshift. But when I have postX, everything is like plug/play with easy customization vs using builder to build out individual block which is so time consuming. The drawback for Free version was limited blocks and starters etc...I love the query function as well. Recently, I read you now have AI integration also which is super awesome!\n\nRecommended for any bloggers that use Gutenberg and speed is not impacted at all.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/e833c352858a4320efbafe7021cd53cc?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/postx/reviews/easiest-builder-for-your-blog-need-256877/",
    "Rating": "5 stars"
  }
]