[
  {
    "Position": "1",
    "User Name": "",
    "Date": "",
    "Title": "Gluten-free?",
    "Review": "This is a nice Block builder. Certain aspects are well thought out, and the blocks they chose to implement are smart, but it just seems like they did not streamline elements of their testing/updating. Certain unacceptable glitches come up with some Blocks and become difficult to integrate. It can be a great product and many of the blocks don't seem to have any issues, but when they do it can feel like Wordpress circa 2004 all over again. I would still rather use the 3 Block builders I bought outside of AS to build in WP, but I'm hoping Gkit gets their stability down because it is a neat and speedy way to build WP sites.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/9d7dab4b8481734475ea510d2994eaf4?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/gluten-free-324744/",
    "Rating": "4 stars"
  },
  {
    "Position": "2",
    "User Name": "",
    "Date": "",
    "Title": "Buggy!",
    "Review": "Unexpected errors for no reason, and annoying to customize things. Unless you are not going to modify the templates, and use things just as they are, this product is for demo sites only.",
    "Avatar": "https://www.gravatar.com/avatar/5ddd7c0a54371284be0494842a6d578e?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/buggy-324553/",
    "Rating": "2 stars"
  },
  {
    "Position": "3",
    "User Name": "",
    "Date": "",
    "Title": "Cool components, but lacking consistency and scalability for website endeavours",
    "Review": "I like the blocks it offers and that they are fully animated, but the quality is very inconsistent. Also, the page templates are very basic and boring. Development since I bought (a month ago) has been minor bug fixing but nothing too serious.\nIf the plugin had a consistent design, proper setup blocks, and fitting templates, along with faster development for features like social media blocks, it could effectively be used for small to medium-scale websites. The editor and blocks lack scalability features, like a unified colour scheme, making them unusable for me at the moment.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/a5254e9d544eb305d03464afdd003aa2?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/cool-components-but-lacking-consistency-324229/",
    "Rating": "3 stars"
  },
  {
    "Position": "4",
    "User Name": "",
    "Date": "",
    "Title": "Great Potential!",
    "Review": "I bought Gutenkit, was very impressed by its features including dynamic content capability, but I noticed some bugs and a compatability issue with Kadence blocks, so I refunded it.\n\nHowever, I just bought it again! The reason is that it really has so much potential and I want these developers to succeed with this product. Gutenkit offers features that are only available in other Pro block plugins which have an annual cost or a high lifetime price.\n\nThe Devs seem to be listening and fixing issues, so their launch on Appsumo is doing what it's supposed to do - enabling a pre-market assessment by power users who in turn get the product for a great price.\n\nIf you're a WordPress user I think it's worth taking a punt on Gutenkit as it could be up there with Kadence, GP and Stackable, but with its additional bells and whistles.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/c0f04e00b3602f4811e81e15f93d826c?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/great-potential-323368/",
    "Rating": "5 stars"
  },
  {
    "Position": "5",
    "User Name": "",
    "Date": "",
    "Title": "Like It",
    "Review": "I’m pleased with the product and delighted to have access to Tier 3. Having been in the website design and development industry for years, I’ve worked with a variety of page builders and Gutenberg addons. Gutenkit offers a wide range of design options, which is impressive. However, while it provides a lot of flexibility, it isn’t as stable as more established tools like Spectra and Kadence Blocks, which have had time to mature in the market.\n\nAs an agency focused on website design and development, I’d like to offer some feedback. While we appreciate the variety of blocks Gutenkit provides, our primary concern is the stability of the addons. When delivering websites to clients, any malfunctioning block reflects poorly on us, not the tool. As such, we tend to avoid using addons that, although feature-rich, may lack the stability we need. In other words, Our first priority is stability, and 2nd is functionality. For Gutenkit to succeed, focusing on creating a stable and bug-free experience is essential.\nI hope you will make stability your first priority as well.\nThank you for the great Tool.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/2_v1yDUYG.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/like-it-323108/",
    "Rating": "5 stars"
  },
  {
    "Position": "6",
    "User Name": "",
    "Date": "",
    "Title": "Well-balanced",
    "Review": "I am quite happy with GutenKit. It's intuitive to use and offers a wide range of options. I particularly like the well-balanced setting options for the individual blocks. I can customize what I need without being overwhelmed by all the possibilities.",
    "Avatar": "https://www.gravatar.com/avatar/d86e538a9709aee539c563172746aa14?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/well-balanced-322993/",
    "Rating": "5 stars"
  },
  {
    "Position": "7",
    "User Name": "",
    "Date": "",
    "Title": "Overwhelmed! You've created an excellent product, now help us use it!",
    "Review": "Overwhelmed!\n\nYou've created an excellent product, now help us use it!\n\n1.  Your naming of the library descriptions could be a more thoughtful and end user friendly = better retention, less appsumo returns.\neg Title: style 1, 2, 3, 4, Is difficult to choose, and remember slowing down user experience\nRename to Title and description - what it does, where to use it and why.\n2.  Please create some natural calm no bs straightforward video tutorials without music or AI voice demonstrating best seo practices and readability on how and why you built the patterns, templates and pages especially for the growing service niches and include image sizes, branding fonts color picking, logo sources like Canva.  This could be done in a podcast series?\n\nSome thoughts for now :)\n\nAnd thanks for sorting out the Bricks Builder issue I had so quickly.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/3d845f8f2ef395512a742b1e55402370?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/overwhelmed-youve-created-an-excellent-322758/",
    "Rating": "4 stars"
  },
  {
    "Position": "8",
    "User Name": "",
    "Date": "",
    "Title": "Has great potential though not ready for prime time",
    "Review": "Edit 10/3/24\n\nHello @Hasib_Wpmet\nThanks for getting back. I am still working with the support, they shared with me a fixed version of the plugin, which unfortunately did not work for me. This is on the left alignment of post info fields in the query builder loop. The other issue for the same query block was for the content filtering. I did read another comment here from a user who reported this issue a month or two ago. I hope the team is taking the query builder with priority. For now, I have resorted back to the default query loop block and using Gutenkit Advanced Image utilizing AFC image field, this setup is much more stable for me. Oh and there is one more issue about the unnecessary template changes, I am not sure how to replicate or document it - In short, whenever I edit a post (or any other content) template that is using a custom header made with Guten elements, upon saving the main template it would almost always ask me to save changes for the header pattern too; However there were no changes made to the header. So, for each template edit, there is a new revision created for header. Sometimes the header gets messed up, misaligned blocks, so then I have to go back and revert to a previous working revision. It just stresses me out, the only changes I see in the header revisions is change in id from, example .gkit4622bc to .gkit000684. That is the only change for 99% of times. I wonder why it would keep doing that. I only emailed the team about this issue briefly a few days ago.\n\nI'd wait before I make changes to the ratings. Gutenkit has potential, also potential buyers should know that the product it is not ready yet for production websites. I have been struggling myself. Well, unless you bribe me with the best Tier available for the offering on AppSumo ;) I believe it is Tier3 or 4 , ha ha!\n\n---------------\nThings I liked, (5 stars)\n- Product support\n- Support team is responsive, though not available in US hours, they would usually get back in 12 hours to a couple of days\n - Concept\n- advanced blocks available within Gutenberg editor\n- Would love to see upcoming features. Team is headed in right direction.\n\nWhat I did not like, (0 stars)\n1. Bugs, bugs, bugs\n- the issues are making me nervous. I have several hours wasted in a day to get around a defect. Or I am doing a write up for the support team to get it fixed.\n\nOverall, the product is promising, I loved its query builder and ability to quickly attach an ACF field to the advanced image block. Lovely execution. Had the product been free from the basic functionality issues, it certainly deserves 7 stars.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/2bc9232a363cb9a11456f04146becd92?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/has-great-potential-though-not-ready-for-322411/",
    "Rating": "3 stars"
  },
  {
    "Position": "9",
    "User Name": "",
    "Date": "",
    "Title": "Versatile and Powerful, but a Little Overwhelming",
    "Review": "I have to admit, I really liked the plugin. It offers many options, allowing you to set almost everything according to your preferences and tastes.\n\n### Advanced Features\n\n- Access to very advanced functions\n- Great choice of blocks for every use case\n\nHowever, I encountered some issues with integrating basic groups on WordPress and the container block available with Gutenkit. Specifically, the problem lies in:\n\n- Elements not always aligning to the left, right, or center\n- Sometimes unable to add borders to elements\n\nOverall, it's a very useful set of tools, especially for someone who is somewhat familiar with website creation.\n\nFor beginners, I would recommend to use mostly basic Guttenberg blocks and only use Gutenkit for specific use cases. The sheer number of options available is overwhelming. Additionally, there are no presets or basic settings to simplify the process, unlike Gutenberg, which offers fixed presets and levels for margin and padding etc.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/avatar_Rr8kxCc.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/versatile-and-powerful-but-a-little-ove-322221/",
    "Rating": "4 stars"
  },
  {
    "Position": "10",
    "User Name": "",
    "Date": "",
    "Title": "Buggy as hell but visually nice and maybe one day it will work",
    "Review": "Great promises, but bugs everywhere that prevent creating a simple grid of articles. I spent hours on the query loop builder. Dynamic data like featured images don’t appear depending on where they are called. Worse, the filtering and sorting of my query loop simply doesn’t work. From A to Z ASC or DESC the sorting is all messed up. I would have preferred fewer working features over all these unusable options. I contacted support—three messages, no response in 24 hours. Not a good experience.\n\nEdit : i have added 1 point because of the sincere answer of developper.\nThanks, i really hope you will correct these bugs before the end of appsumo offer.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/0363112a93b47d105db691123791c053?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/buggy-as-hell-but-visually-nice-and-mayb-321998/",
    "Rating": "3 stars"
  },
  {
    "Position": "11",
    "User Name": "",
    "Date": "",
    "Title": "Simple, and awesome",
    "Review": "I am really enjoying using GlutenKit. It was easy to install, and it is straightforward to use. It is simple, has great options for site building, and has given me a lot of value. I will be using it regularly for my website builds, keen to see updates as it grows! It would be cool to see if users could submit templates to the library too.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Logo_Personal_Brand.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/simple-and-awesome-321993/",
    "Rating": "5 stars"
  },
  {
    "Position": "12",
    "User Name": "",
    "Date": "",
    "Title": "Very interesting as a concept",
    "Review": "This builder is very promising... We'll see with time and updates, but it meets certain developer needs.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/elephant.jpg?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/very-interesting-as-a-concept-321925/",
    "Rating": "5 stars"
  },
  {
    "Position": "13",
    "User Name": "",
    "Date": "",
    "Title": "Finally, a fully usable Gutenberg Page Builder.",
    "Review": "Likes: All the features found in it's sister company (Elementskit) plus a few extras. Very Fast. Fantastic price deals at the moment. More features than almost all other Gutenberg block builder, Plus very quick and helpful Tech. Support - what's not to like?\n\nDislikes: Nothing really, I suppose a few more templates and a Block theme would be handy but this is a new package still in development so... HIGHLY RECOMMENDED.",
    "Avatar": "https://www.gravatar.com/avatar/f6a3cd3784be907b3222f77231c7ffc2?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/finally-a-fully-usable-gutenberg-page-b-321875/",
    "Rating": "5 stars"
  },
  {
    "Position": "14",
    "User Name": "",
    "Date": "",
    "Title": "Incomplete and complicated",
    "Review": "The samples are very nice, but they are far from reality.\n\nThe developers have wanted to cover many blocks, but forgetting about the basic settings.\n- It is very surprising that none of the Blog post or Grid blocks allows to show the excerpt of the entries (in some only the title, in others the content limited by words, but not the excerpt).\n- The settings panel of each block is integrated into the right menu of the WordPress editor, where the options to adjust are mixed in the view with each other (not even the sections are highlighted with a thicker font or another color).\n- Blocks don't have automatic resizing when you resize the screen. You have to create several layouts (working type).\n- The appearance that you configure in the WordPress editor, has nothing to do with what you see later when you publish the page.\n\nFor this builder to have any real utility, and be easily managed, the build should be done from the WordPress customizer, not from the page editor.\n\nOn the other hand, I also tried to use the support and it was really bad. They simply refer you to read the plugin documentation without helping at all or solving any doubts.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/4cbae6fca265780bfe1c004cb248a0eb?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/incomplete-and-complicated-320656/",
    "Rating": "2 stars"
  },
  {
    "Position": "15",
    "User Name": "",
    "Date": "",
    "Title": "Let's the party begin!",
    "Review": "Fullstack buyer here... just because I had a feeling to be my next \"toy\". Well, is not a a toy. it's a serious competitor to all existing comparable Gutenberg add-ons. Still testing and no errors (with all options activated), has a friendly UI, not confusing, and I'm not experiencing any speed decreasing on backend. Also a lot of templates. With an experienced team behind I'm expecting to be responsive to customers requests and I'm quite sure will be frequently updated to be one step ahead from the competition. You have a new fan here. Good luck with sales!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/GN_round.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/lets-the-party-begin-320056/",
    "Rating": "5 stars"
  },
  {
    "Position": "16",
    "User Name": "",
    "Date": "",
    "Title": "No need to Curb FOMO on this Product 😍😍😍",
    "Review": "I have tested this product and to me it turns out to be quite amazing product. I’m genuinely impressed with GutenKit, and there are many reasons why it stands out. It’s clean, fast, and packed with advanced features.\n\nHere’s why you shouldn’t miss out this deal, especially if you’re an agency owner—\n\n✅Extensive Template Library 📚: GutenKit offers a vast collection of professionally designed templates. Whether you’re a newbie or a pro, you’ll find something that fits your needs. If you’re not a designer or simply don’t have the time, you can easily use these ready-made templates to create stunning pages quickly.\n\n✅Fast Performance ⚡: Pages built with GutenKit load quickly and are clean coded. Unlike Elementor, which can slow down site, GutenKit helps maintain speed and efficiency. I just wish they’d rebuild ShopEngine for Gutenberg too!\n\n✅Advanced Features 🔧: GutenKit includes impressive features like a Mega Menu Builder, dynamic content options, and a query builder. It supports Full Site Editing (FSE) and is consistently updated to fix bugs and enhance functionality. Those who continue developing the product, are the ones who stay or rule the market.\n\n✅Excellent Support 💬: To me support is crucial while evaluating a product. GutenKit excels here too with ample documentation, some video tutorials on YouTube and email support. I would like if they could add chat support as well.\n\n✅Expect Longevity 🏆: The team behind GutenKit has been in the WordPress business for a long time and has developed about 6-8 tools, AFAIR. They have large team for development alone. All these factors indicates they are honest people with a long term vision. So you can believe that the product will continue to evolve and won’t leave you facing unexpected issues.\n\n✅Fair Price: Most importantly, the product is fairly priced specially the unlimited plan here at Appsumo. Agency owners can be easily achieve their ROI with just a handful of projects.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/dd87453c2642d90e03942b96b7a3903f?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/no-need-to-curb-fomo-on-this-product-320028/",
    "Rating": "5 stars"
  },
  {
    "Position": "17",
    "User Name": "",
    "Date": "",
    "Title": "Perfect Web builder - Fast and minimalist",
    "Review": "I've tried a lot of web builder and I can say that this is on the top of my favorite. It is fast and simple to use. Does not affect site performance and minimalist.\n\nWhat I like about it is the additional blocks and the continues update of the template library which is very helpful in the future.\n\nPS: The support team are the best!",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/chat.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/perfect-web-builder-fast-and-minimalis-320020/",
    "Rating": "5 stars"
  },
  {
    "Position": "18",
    "User Name": "",
    "Date": "",
    "Title": "Does not work with Kadence, plugin not ready",
    "Review": "Seems like a good plugin if you don't have a premium theme and plugins. There are way too many conflicts with Kadence, button color conflicts, sticky menu settings not saving, mobile view conflicts with Kadence.\n\nAgain, this might be a great plugin if you're using an off-the shelf free basic theme.\nThe team is very responsive. Maybe these bugs I mention will be fixed soon, or not.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/3d_Bn_1st_Mar_Logo.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/does-not-work-with-kadence-plugin-not-r-320007/",
    "Rating": "2 stars"
  },
  {
    "Position": "19",
    "User Name": "",
    "Date": "",
    "Title": "I am impressed by GutenKit!",
    "Review": "I just bought LTD and I am really excited, this plugin has many features other plugin doesn't have. I would like to see more features such as Slide Shows, Sticky Header, Transparent header etc...\n\nI would also like to mention there are few issues with formatting and displaying. I tested it with 2024 theme, and it looks like it doesn't display content correctly on both editor and viewer side. Also there are performance issues in template library displaying. I hope you will improve these features in future. Also fonts/Styles need to improve and add more.\nThank you for the amazing product and amazing deal.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/7a6fe567652cb0f422d2670f1685f49b?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/i-am-impressed-by-gutenkit-319987/",
    "Rating": "5 stars"
  },
  {
    "Position": "20",
    "User Name": "",
    "Date": "",
    "Title": "Don't miss this opportunity, believe me!",
    "Review": "I've been using this plugin for a few days now and all I can say is: take advantage of this opportunity while you can! I've been using Elementor for a few years now, but the performance issue has always bothered me, despite it being an excellent resource for creating beautiful websites in a practical way. Lately, I've been researching and using several block modules, such as Stackable, GreenShift, Spectra, among many others. Each one has its advantages, but none of them have completely satisfied me so far. That is until I tried GutenKit! The only one that really encouraged me to replace Elementor in my clients' projects was GutenKit. Amazing!\n\nThe main visual editing and customization features of the blocks that I need are present in GutenKit, such as margin adjustments, padding, colors, fonts, spacing, backgrounds, etc., all with the detail I need.\n\nA feature that I would love to see implemented is the possibility of using dynamic data in graphs and tables, such as links to Google spreadsheets, like other plugins. Another feature that I believe could be improved is the dynamic loop, but I confess that I haven't been able to use all of the features yet, so it's probably just that I haven't learned how to get the most out of it yet.\n\nI'm building a new website for a client and I'm impressed with its speed, both on mobile and desktop. I installed the free Spectra One theme with the GutenKit plugin and so far this is the perfect combination for me!\n\nIn short, I bought the 3 codes because I don't want to miss out on this opportunity. I'm in love with this plugin, and because of the quality of what I've seen so far, I'm sure the developer will improve it even more.\n\nOther than that, I can only congratulate the team and thank them for this incredible offer. Keep up the excellent work and you'll go even further!\n\nNote: let me know if you plan on doing the LTD version of your custom email module, because I won't think twice about buying the full stack if you put it here on AppSumo!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/logo-cliks-180px.png?width=150",
    "Review Link": "https://appsumo.com/products/gutenkit/reviews/dont-miss-this-opportunity-believe-me-319469/",
    "Rating": "5 stars"
  }
]