[
  {
    "Position": "1",
    "User Name": "",
    "Date": "",
    "Title": "What am I doing wrong?",
    "Review": "This product is very well reviewed and on paper it is a beast of a Wordpress builder. But despite running a laptop with 64GBS of ram, MaxiBlocks is an absolute beast of a resource pig. I have no idea why, but the experience of trying to build blocks and use it as intended is painful, ridiculously slow, sounds like my laptop is gearing up to speed down the runway, and for lack of a better word, glitchy. I tried reaching out to support, and my email bounced back. I've shut down all other web browsers, and it is still painfully bothersome. I've used Elementor, Elements Kit, and have an enterprise level Brizy Pro, and I'd recommend any of those more than I'd recommend this kit. I am still working with it, but for the past two days it has given me nothing but frustration. If someone else can help point me in the right direction on what I am maybe doing wrong, I'd welcome that in a heartbeat!\n\nI am going to keep trying, but holy crap, this was supposed to be a 5-taco feast, but now I am feeling the taco's revenge!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/209d67abde49617e352c937580b5ab05?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/what-am-i-doing-wrong-318555/",
    "Rating": "3 stars"
  },
  {
    "Position": "2",
    "User Name": "",
    "Date": "",
    "Title": "Ab-so-lu-tely wonderful!",
    "Review": "Wow! And I mean WOW! Maxiblocks is my new absolute love. I have never thanked myself so much, like I thank myself for getting this deal. If I were to choose just one AppSumo deal to buy in my whole life, I would wish it was Maxiblocks.\nFirst, I had no idea how to use it. But I found some tutorial on YouTube, watched it for 15 mins - and that was it, it gave me an idea what kind of logic is to be applied while working with Maxiblocks. I can't say it was fast and easy from the very first moment, I needed some time to grasp it, but once I have - oh my, there is no stopping me now!\nAfter playing with Maxiblocks for one day, I must say it is a wonderfully versatile and amazingly fast tool. The site I built is lightning fast, too. I am beside myself, so amazed I am with the site's speed, in spite of the numerous elements I put there.\nAnd the templates - soooo many of them! I am getting kind of joyous vertigo from browsing through those beautiful, so beautiful templates!\nMaxiblocks are (is?) unbelievably generous. And still, I am getting lots of email, informing about new features being rolled out. I can't fathom, how lucky I am, for getting so much quality for so little money...\nI know my review sounds emotional, but those few first hours of working with Maxiblocks gave me so much joy and pleasure, and so great satisfaction with what I was able to achieve, and the feeling I scored a gem, and the feeling I can do anything I want, even if I am not a techie... Christiaan and the whole Maxiblocks Team, I just LOVE your product!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/logo_wiatrodyskretni_150X150.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/ab-so-lu-tely-wonderful-318548/",
    "Rating": "5 stars"
  },
  {
    "Position": "3",
    "User Name": "",
    "Date": "",
    "Title": "Don't Miss It!",
    "Review": "I've been waiting for MaxiBlocks to come back to AppSumo so I can test it out. I have other builders as well so I've got some contrast to compare with.\n\nI've only used MaxiBlocks for about a day but it seems to be very user-friendly and intuitive. The Pro blocks which this deal allows you to access look really, really well-designed.\n\nThe value for this plugin is amazing. I'd highly recommend it.",
    "Avatar": "https://www.gravatar.com/avatar/1a17ab428a46cec831e6222239fa3221?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/dont-miss-it-317135/",
    "Rating": "5 stars"
  },
  {
    "Position": "4",
    "User Name": "",
    "Date": "",
    "Title": "Business in a plugin!",
    "Review": "I couldn't believe how wow Maxi blocks is! I wanted a plugin website builder for Gutenberg that was templatized for easy deployment of professional websites. Maxi blocks makes me feel like a professional designer. I cannot only make beautiful 😍 sites for my business but my clients sites as well. I can only see this plugin getting better and even more flexible. It is a contender and life saver for artistically challenge. It opens my mind to so many possibilities. If this deal opens up again you better not miss it! Passion and love went into this plugin, thank you Maxi Blocks!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/a68585a74cfaa90ef01d2e6d1795cabc?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/business-in-a-plugin-301438/",
    "Rating": "5 stars"
  },
  {
    "Position": "5",
    "User Name": "",
    "Date": "",
    "Title": "Good enough already",
    "Review": "Their template library is already vast, but more variety in the styles would be very much welcome. I'm looking for more light effects, technology-centric, and futuristic themes.",
    "Avatar": "https://www.gravatar.com/avatar/de97620ceaf5bab2f27325df84c06b09?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/good-enough-already-300273/",
    "Rating": "4 stars"
  },
  {
    "Position": "6",
    "User Name": "",
    "Date": "",
    "Title": "Nice",
    "Review": "For us it is an alternative to other WP builder out there. It is really easy to build cool pages. Their support is fast and friendly.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/img-om-raster_NlAZhbY.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/nice-299504/",
    "Rating": "5 stars"
  },
  {
    "Position": "7",
    "User Name": "",
    "Date": "",
    "Title": "Good Product But Needs Work",
    "Review": "This is a good product that has a lot of great designs. However, as a software engineer who has built tons of WordPress sites (although not my fav thing) I still like WordPress for when many people in a company will edit things. WordPress core team has done a good job in keeping up with the times. In the days of everyone building in express/node NPM - WordPress has stood test of time.\n\nFirst, if you do not have the recommended setup ie. Maria DB up to the version they recommend, and your server instance is running on a older Ubuntu like I had one running on 16.04 - prepare to have to get a new server instance. First, MariaDB is not as straight forward to upgrade to via server - so you need to understand how to do that and the complications that could be faced.\n\nYour best bet is going to be a new server instance, Cloudways is one of the few that offers this and later versions of MariaDB.\n\nWithout this, Maxiblocks is a resource hog and can be a nightmare to edit with. There will be times that css changes just don't occur - this is after hours and hours of maybe working on something. You can try to duplicate it or save the box but then move to a new page - but most likely it will still not work. I had one time where when I switched themes, then switched back the css ie. the css they inject in with their var's started working again but majority of the time it did not, and I was basically creating all my css manually.\n\nNot a good experience and not workable at any sort of scale.\n\nNext, I did upgrade and get the latest Ubuntu and MariaDB on Cloudways. This significantly improved Maxiblocks.\n\nThe plus is there are a lot of designs and they are done in a way that can get you a good looking website. I'm from DC but this looks like a Berlin type design / group. The interface is good to use as long as you have the latest and fastest server / correct Maria DB.\n\nHowever, there are a lot of little kinks. It's open source so technically, I believe you are paying for the \"pro\" features - not sure if you could just Fork and get it for free.\n\nSo, first they use Hello Theme for Elementor which they call their MaxiBlock 100% width theme.. But it's just a modified HelloTheme and you will get asked to install Elementor but you don't have to..\n\nThey have very bad documentation. Almost comical in how low detail it is.\n\nIf you want to create a header for your complete site, you will most likely have to create the header on each page - and footer as well. The work around is using a theme other than Hello Theme that allows FSE and then Maxiblocks will create a header and footer.\n\nThey say there is a Maxiblock theme coming out soon so hopefully that helps with the situation.\n\nNext, lets talk about pages that need a structure ie. singlular blog, 404 pages, or any custom post types. There is a way to query ACF fields but without FSE, you will be creating every blog again and again. They have something called 'Style Cards' - but there documentation is so low on that, I don't even get it. I think it's main purpose is to control the simplistic format of a header, paragraph, graphic, font etc so that you don't have to use the default and keep changing things.\n\nOnce again, extremely hard to figure out & could have been easy. As I was trying to figure out why my pages would inherit things like Roboto and certain colors and could not figure out where defaults are set.\n\nThe blog system they use ie. the system they use to show queryable content lacks features and doesn't always work. I've had times when 'Accumlator' - another feature that has very little to no explanation didn't work. Now, what if you want to have a 'Also check out' type blog query after your blog post. How can you make sure that the current blog post does not show up in the query? Can you use Accumulator for that? I think you might be able to do that but then youd have to repeat this for each blog post. From what I've seen, its basically just using the # of the blog post from the filter you set. So if you are setting up a design with 1 featured blog post on the left, and then have the other blog posts on the right, you would set accumulator to 2. On a normal blog situation, you are not going to count this so it needs to be done via code to skip the post that is currently featured. Possible potential to use CSS but again, this is not a pretty solution.\n\nAs of right now, this is good for landing pages. They have no form functionality - you will still need Gravity Forms. I believe they just fixed their video functionality to pop up a modal, but that wasn't working prior. The numbers for scroll effect run funky. They dont allow decimals and arent as smooth as others I have used.\n\nWhen you are editing Text and say you change a certain color or font to some parts of that text block, it can change the variables each time there is a change, thus if you had something going on in css ie ::after or ::before - you would have to be aware of that and change accordingly.\n\nIt has a lot of work to do to really become something that is ready for a production website that is bringing in a lot of traffic. I would not use this for that. Since I moved to Cloudways, the problems have lowered a lot meaning it looks like there are no issues with saving but there is still too much uncertainty.\n\nI haven't even dabbled in their interaction design, looking at it, just makes me want to use my own JS or JS library. But since I'm on a server and Maria DB that doesn't take forever to load, I guess i'll give it a go.\n\nAgain, if you are using this as a landing page - great solution as long as you have your own form system.\n\nIf you are using this for some site inspiration - it has some okay designs - better than most block plugins i've seen.\n\nIf you are using this to develop a full website that is for a non-small business client - then you will need to be careful. First, you will need to use a FSE theme. Next, you will need to be aware of the quirks and figure out if the staff that will be editing it will find it intuitive or not. You will most likely have to create your own react blocks for many things, or use another library as well. Of course, you can use the built in blocks and then stylize and edit the code to customize.\n\nMaxiblocks does allow you to grab the code so I technically think you would be able to just grab the blocks you want and customize it but I actually am not sure - may have to go to their open source project and do that. You can save the block but not sure if you can edit the functionality & the css is all inherited.\n\nThere are also other annoying things like the copy styles. I remember having to do this numerous times because there was no duplicate. Well the way to do it, is you have to open up the document overview, find the text element then you can duplicate it - again, nothing that I found in the documentation (or maybe I just didn't look hard enough).\n\nI'm giving a honest review, as I believe in not being biased. I believe that is where Appsumo shines, not when someone is incentivized or trying to bring traffic to their Youtube review.\n\nI do believe this project has legs and will continue. It is a buy for me just for the designs. With their own theme, this could change to a must buy.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/f8a621f6d10604e71b8650783e6e75f3?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/good-product-but-needs-work-298784/",
    "Rating": "3 stars"
  },
  {
    "Position": "8",
    "User Name": "",
    "Date": "",
    "Title": "P + L / PR = NB",
    "Review": "I have used most of the web builders over the years but I cant think of one that was more user friendly. When you factor the product capabilities, lifetime license, with the low price Its a No Brainer. I'm In!",
    "Avatar": "https://www.gravatar.com/avatar/f556a20a076d80d15493ad88397694e3?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/p-l-pr-nb-298408/",
    "Rating": "5 stars"
  },
  {
    "Position": "9",
    "User Name": "",
    "Date": "",
    "Title": "It should be WordPress Native",
    "Review": "This is a promising great plugin that takes the WordPress Gutenberg a step forward & makes life much easier & site building more fun. Colors cards are great.\nIt can be used combined with other good Gutenberg blocks plugins as Spectra & Kadence (not fully).\nSince it is based on Gutenberg it is better speed optimized than Elementor.\n\nWhile I believe it is a great choice to buy, & that I'll build all next sites using it, I also want to mention the cons:\n\n1. It cannot be used offline & when not connected also to Maxiblocks website. I like many times to build offline (fully undistracted) & for me it is a disadvantage.\n\n2. There is no shortcut or easy way to migrate from Elementor to Maxiblocks. I mention it because while preferring it on Elementor, I would like not to renew my Elementor payments & migrate these sites to Maxiblocks.\n\n3. There are still many missing features, however, according to the roadmap we'll see them in the future, while meantime need to use third party solutions or our own coding.\n\nYet, I believe it is a very good & fun & rich choice to build a new website.\n\nThanks\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/7523cdf6c67f570a13e1eccc92973af4?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/it-should-be-wordpress-native-298269/",
    "Rating": "5 stars"
  },
  {
    "Position": "10",
    "User Name": "",
    "Date": "",
    "Title": "Ditching Elemet*r for this",
    "Review": "The best page builder plugin I've ever seen. Why? It has so many features. Firstly I thought the plugin was so complicated with so many features. Those features are just overwhelming for newbies like me. But hey, those features are exactly what you get in Elementor Pro. The best part, those features are available for free in Maxiblocks. We pay only for the pro ready-to-use design elements. This is so great!! Hence, my wish for the team behind this plugin, please constantly add more and more elements, templates, and so on. And one more thing, also please make more video tutorials covering the plugin. Because I think the only different between this and Element*r is that Element*r is a long established plugin so it has so many tutorials out there and people already get used to it. Other than that, Maxiblock is way better. Thanks.\n\nOh, I'm surely ditching Element*r for this.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/5800297d4af8f3144ff1f2ab46da8d78?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/ditching-elemetr-for-this-298226/",
    "Rating": "5 stars"
  },
  {
    "Position": "11",
    "User Name": "",
    "Date": "",
    "Title": "Must have plugin",
    "Review": "I picked this up on it's first run and it's proven to be a brilliant purchase. At tier 1 you can install this on UNLIMITED sites!\n\nYou'll need to get used to the full site editor system WordPress has introduced, MaxiBlocks helps make that system a little easier to use with thousands of pre-defined design elements you can quickly drop onto your website.\n\nI've done a video walkthrough: https://www.youtube.com/watch?v=Esf0rEfl5-k\n\nThe team have been consistent in rolling out updates and have been helpful when I've sent them messages.\n\nIf you're a WordPress user this is the easiest decision you'll make given the low price.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/LinkedIn_Profile_Photo.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/must-have-plugin-298056/",
    "Rating": "5 stars"
  },
  {
    "Position": "12",
    "User Name": "",
    "Date": "",
    "Title": "Awesome Product",
    "Review": "Just wanted to say this is an awesome product. Yall outdid yourselves. Designs are great and super easy to use.",
    "Avatar": "https://www.gravatar.com/avatar/ee8d7b7b540cc2caa9b3226778f028c6?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/awesome-product-297997/",
    "Rating": "5 stars"
  },
  {
    "Position": "13",
    "User Name": "",
    "Date": "",
    "Title": "Happy Customer",
    "Review": "I have been following Maxi Blocks for a while now. I saw their product and I highly recommend it for the following reasons:\n\nThe plugin is 100% free with all the functionality that comes with it. YES, FREE. There are no pro features. Everything is included.\nMore than 13k free icons which could be colored to meet our needs.\nEach week they are adding new patterns, pages, and icons.\nThere are free patterns and pages available.\nThe cards (style guides) are great for starting your project with consistency. Everything that you import into the pages is styled based on the cards so it reduces changing a lot of styles manually.\nThey are actively working on the pages, patterns, icons, and the plugin itself.\n\nThe only pro areas are pages and patterns meant to reduce the design and development type as they are done for us. You could create the same patterns and pages from scratch with the free version but I recommend getting an account to speed up your development time.\n\nI am waiting for their theme because once it is out, I will be moving to Maxi Blocks 100% to our design and development needs related to WordPress.\n\nFor one deal of Maxi Blocks, you cannot even get a year of any other page builders. Take a look at their videos and you will be surprised by the details and work put into this product. Don’t wait until it is too late. I am a happy customer and this is a must-buy.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/uifaces-cartoon-image.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/happy-customer-297980/",
    "Rating": "5 stars"
  },
  {
    "Position": "14",
    "User Name": "",
    "Date": "",
    "Title": "Amazing products",
    "Review": "Easy, clean, and responsive designs with great support. They're always adding new designs on top of what they already offer. 5 out of 5 tacos!",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/2164321316_37b5fe1c13_b.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/amazing-products-297955/",
    "Rating": "5 stars"
  },
  {
    "Position": "15",
    "User Name": "",
    "Date": "",
    "Title": "This genuinely makes me want to do some wordpress projects",
    "Review": "If you have had any wordpress experience then you have to test maxiblocks because its seriously going to change your mind about wordpress. Maxiblocks has in my opinion the sexiest designs out there. Coupled with a great user experience to make obvious branding adjustments. Honestly I did not need to change anything else so I cannot comment.\nI just hope that they come up with an alternative for non-wordpress site design.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/me_Q0UcZ0P.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/this-genuinely-makes-me-want-to-do-some-297919/",
    "Rating": "5 stars"
  },
  {
    "Position": "16",
    "User Name": "",
    "Date": "",
    "Title": "Great Template",
    "Review": "Awesome , Amazing\nElementor replacement.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/1000001656.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-template-297910/",
    "Rating": "5 stars"
  },
  {
    "Position": "17",
    "User Name": "",
    "Date": "",
    "Title": "amazing",
    "Review": "Impressive and quality template.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Nova20240116201421.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/amazing-297904/",
    "Rating": "5 stars"
  },
  {
    "Position": "18",
    "User Name": "",
    "Date": "",
    "Title": "Great",
    "Review": "Great for Wordpress.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/popsocket-American_Bison_Flag_-_Patriotic_Bison_Wildlife_Graphic-productor.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-297890/",
    "Rating": "5 stars"
  },
  {
    "Position": "19",
    "User Name": "",
    "Date": "",
    "Title": "Awesome Templates",
    "Review": "I am delighted with MaxiBlocks. It helps to speed up my workflow immensely, thanks to the numerous beautifully designed templates. A product with a lot of potential. The support is also great: Marko immediately offered to start an online call so that he could solve my problems together with me and also gave me an introduction to the features of the builder. Other great features are the numerous beautiful icons and the powerful animation engine. I'm especially looking forward to the new Full site editing theme, which should be out soon.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/mirco-profile.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/awesome-templates-287558/",
    "Rating": "5 stars"
  },
  {
    "Position": "20",
    "User Name": "",
    "Date": "",
    "Title": "Very good with even greater potential",
    "Review": "I think this is a very good product. Once you get the inner logic you can create a beautiful website within minutes. The new templates are coming each week. The the icon library is just awesome.\nWhat is more the support is great. They offer you a very helpful call with going life on screen. I am really glad I bought 2 codes.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Waldemar_Kompa%C5%82a_0151_pp_Anna_Bu%C4%87kowska_mini.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/very-good-with-even-greater-potential-286250/",
    "Rating": "5 stars"
  },
  {
    "Position": "21",
    "User Name": "",
    "Date": "",
    "Title": "Great Templates",
    "Review": "While Maxiblocks can be improved by removing the extra divs (so that we can use it with Automatic.css), I like the sheer number of templates that we can quickly iterate on.\n\nI covered about Maxiblocks too on my site,\nhttps://newsletter.leokoo.com/issues/10",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Official_Profile_Pic_Small_5IGQ7Fe.JPG?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-templates-285748/",
    "Rating": "4 stars"
  },
  {
    "Position": "22",
    "User Name": "",
    "Date": "",
    "Title": "Best Support and promising features",
    "Review": "I had a problem with my account regarding the team tab. This was quickly resolved by Christiaan. The support is efficient and fast. MaxiBlocks has a future for future Gutenberg features. Of course there are always improvements to be made, that is the aim of this search towards the best that I hope for the people who have embarked with MaxiBlocks",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/logo-small-transparent.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/best-support-and-promising-features-285330/",
    "Rating": "5 stars"
  },
  {
    "Position": "23",
    "User Name": "",
    "Date": "",
    "Title": "Worthless",
    "Review": "I can't believe i fell for the reviews that said it's like brizy and elementor. It's not it's a template add on to gutenberg where you pay for a few more basic templates. If they become like a page builder great. They aren't at all like a page builder they're just a template plugin and you can get most for free. Appsumo failure to allow this to be misrepresented.",
    "Avatar": "https://www.gravatar.com/avatar/8562138d8e62eaecfa1ab32e617bd284?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/worthless-285121/",
    "Rating": "1 stars"
  },
  {
    "Position": "24",
    "User Name": "",
    "Date": "",
    "Title": "A promising builder",
    "Review": "I use Divi but was looking for a plugin to use Gutenberg. This plugin may meet my needs\n\nPositives points:\n- I bought this plugin because I really like the design of the pages and it's not easy to find modern templates for Gutenberg.\n- The latencies in the builder have been corrected, which is a good thing, and the creator seems motivated to improve his plugin.\n- Modifications are easy to make and the plugin is intuitive.\n\nNegative points :\n- I find the login system in the template library restrictive, as I often have to enter my email or log back into my account, which is not practical at all. I don't know if it's when I change computers or if it's during an update, but today, my pro identifiers weren't remembered.\n- The plugin uses a lot of memory, which can be restrictive for some hosts with limited ram.\n- I tried to translate the plugin with Loco translate. The strings were found, but most of the texts were not modified. All builder texts remain in English. I can also help you translate it into French if you wish.\n\nIn the end, for the price I didn't hesitate and I really recommend this offer despite a few negative points that I hope will be corrected. Hurry up before this offer disappears!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/36e6e4ed2ef8469faf3e5012eaa5e06b?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/a-promising-builder-285059/",
    "Rating": "5 stars"
  },
  {
    "Position": "25",
    "User Name": "",
    "Date": "",
    "Title": "Very Good Deal",
    "Review": "This is a good deal for Wordpress developers. One thing lacking is Elementor support. I would keep the agency license if its included in sooner.\n\nThis is not a replacement for your other page builders. Its an addon for developers lacking designer skills. Most page builders provide excellent backend support with forms, custom post types. Maxiblocks is just starting and may take a long time to mature on that front. Until then, support for most page builders is recommended.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/IMG-20240429-WA0007_LWZwoJm.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/very-good-deal-284721/",
    "Rating": "5 stars"
  },
  {
    "Position": "26",
    "User Name": "",
    "Date": "",
    "Title": "A king in the making",
    "Review": "Tried my hands on this gem and I think Maxi Blocks could rule the wordpress builder ecosystem in a few years as it caters to both the enthusiasts and the developers and everything in between.\n\nI love the style cards and I wish they can expand on it to include other global settings like spacing, sizes and other stuff that make for consistent design.\n\nThe pattern library is massive that it is rare not to find something that gives you a starting point or jumpstart your creative design.\n\nThere are still the basic building blocks. I recommend they checkout The Plus Addon to develop robust design blocks.\n\nThe reason for giving 4 tacos is because there's still some time to maturity but this is already looking great. Support is so fast in responding to email - I've sent three over one week period - that I wonder if they sleep at all or I am just lucky with timezone.\n\nHopefully the theme comes in with a bang - not bugs - so the team can have the stability to develop into the future.\n\nGodspeed.\n\nKeep it up.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/ed8d554dacfd7f66f00e535e122ddb45?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/a-king-in-the-making-283899/",
    "Rating": "4 stars"
  },
  {
    "Position": "27",
    "User Name": "",
    "Date": "",
    "Title": "So many beautiful finished designs",
    "Review": "I managed to buy your creation. I wish you success in sales and product development",
    "Avatar": "https://www.gravatar.com/avatar/bdf8aeadced2a59389d383e25911280d?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/so-many-beautiful-finished-designs-283848/",
    "Rating": "5 stars"
  },
  {
    "Position": "28",
    "User Name": "",
    "Date": "",
    "Title": "takes up the block idea so wonderfully.",
    "Review": "Wow, rarely seen such a sophisticated and beautiful plugin for Wordpress that takes up the block idea so wonderfully.\nOf course, you have to familiarize yourself with the various configurations at first.\nThe template library is quite impressive. However, I am still missing a few essential blocks from the Marketing & Products category, but I hope that they will be \"designed\" soon.\nMissing for example\n\"Review-Block or Test-Block\" with pros & cons section and test result with scores;\nProduct blocks with prices, discounts, etc. and CTA#\nComparison blocks or tables\nLooking forward to the theme that comes out\n4 Tacos but I am sure it will become 5 with further development\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/chris_von_nischenbootsrapping.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/takes-up-the-block-idea-so-wonderfully-282765/",
    "Rating": "4 stars"
  },
  {
    "Position": "29",
    "User Name": "",
    "Date": "",
    "Title": "I love it",
    "Review": "No brainer to purchase in my opinion.",
    "Avatar": "https://www.gravatar.com/avatar/a954b7758582017d7224f97959b3ddf8?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/i-love-it-282596/",
    "Rating": "5 stars"
  },
  {
    "Position": "30",
    "User Name": "",
    "Date": "",
    "Title": "Impressive product and Support",
    "Review": "MaxiBlocks is close to being a One-n-Done addon to the Gutenberg editor. And it keeps getting better at a fast pace. There are a good number of well-deserved reviews here that detail the product - I'm writing this to compliment their Support.\n\nI had a question that was responded to quickly, to which I asked a second question that was answered almost immediately - not expected since my late morning is late afternoon in Portgual. Not only was response time quick - Kyra was watching the Ticket and jumped in with additional suggestions.\n\n5 Tacos indeed, Kyra!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/profile-pic-maine-sq-300.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/impressive-product-and-support-280560/",
    "Rating": "5 stars"
  },
  {
    "Position": "31",
    "User Name": "",
    "Date": "",
    "Title": "Can't imagine using Wordpress without this",
    "Review": "Although I have some technical proficiency with coding etc., I have zero design skills, and I've always found designing in Wordpress highly intimidating. I've used most of the other page builders, purchased their subscriptions in the past, but none of them compare to Maxiblocks in my opinion.\n\nThe style cards make setting brand colors easy and global, but overriding them is simple. The way the columns and the blocks are represented by the flexbox hierarchy on the left, with the effects and infinite editing options on the right, is incredibly intuitive. It feels like the Wordpress design cockpit I always wanted to have, and now I can't imagine working with Wordpress without it. Dynamic content, ACF integration, works with pretty much any theme, it ticks all the boxes. I can even use it in Firefox with no worries, unlike far too many big companies' products.\n\nLong story short, it does exactly what I need it to, loads much more quickly than the bloated page builders of the past, and the support is incredible. I almost don't want to say how helpful the team was, because I can't imagine it would be scalable for them to give that level of personal tutorial for everyone. :) I was afraid because of past experiences with other page builders and my inability to think visually, but this is so straight-forward and has so many pre-made blocks and templates, it's really easy to jump right in and come up with something professional-looking.\n\nNow I just think of it as the way Gutenberg SHOULD work. Do NOT sleep on this.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/_1608e776-b33d-4bb3-ac50-a2e058726e2d.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/cant-imagine-using-wordpress-without-th-280537/",
    "Rating": "5 stars"
  },
  {
    "Position": "32",
    "User Name": "",
    "Date": "",
    "Title": "Full Featured Gutenberg Blocks - Super Value!",
    "Review": "I've only recently started using MaxiBlocks but can already see it becoming a main resource for website builds as I move away from page builders like Elementor and Divi to create more native WordPress builds using Gutenberg and Full Site Editing.\n\nThis AppSumo deal is for unlimited access to the 100s of MaxiBlocks premium templates which are a huge time saver. If, like me, you're not a natural designer and prefer to tweak someone else's designs, then MaxiBlocks is definitely worth checking out, it's incredible value for the number of designs available.\n\nI'm very happy with this purchase and glad to support MaxiBlocks who give away their page builder and a decent number of designs for free. The blocks have advance settings and I was delighted to see they support dynamic content.\n\nTCommunication from the MiaxBlocks team is really enthusiastic and I'm looking forward to seeing what they do with their upcoming Full Site Editing (FSE) theme.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/c0f04e00b3602f4811e81e15f93d826c?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/full-featured-gutenberg-blocks-super-v-280128/",
    "Rating": "5 stars"
  },
  {
    "Position": "33",
    "User Name": "",
    "Date": "",
    "Title": "Good Better Best",
    "Review": "I hardly write a review on Appsumo. I have built a fantastic SPA website using this plugin and am about to build a second one. This is by far one of my best purchases on Appsumo. I have been using Divi Builder for years. This will replace DIVI due to its ease of use and premade templates.\n\nThe only extra work I have to do is build my header and footer and start plugging Maxi templates in the Gutenberg content area.\nI will be upgrading to the Agency Plan.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/aca2a78755c01ffa2f9212c69ab489f8?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/good-better-best-279437/",
    "Rating": "5 stars"
  },
  {
    "Position": "34",
    "User Name": "",
    "Date": "",
    "Title": "Keep Gogo",
    "Review": "I love it. Awesome product.",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Vidsuite.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/keep-gogo-278952/",
    "Rating": "5 stars"
  },
  {
    "Position": "35",
    "User Name": "",
    "Date": "",
    "Title": "Solid-All around",
    "Review": "Great website builder. Easy and intuitive with TONS of 'blocks' to use as templates. Creating a professional looking website only takes minutes, not days.\n\nThe only thing better than the website builder is their service. I've reached out to them numerous times with various questions, and each time they deliver fast and actionable advice.\n\nHighly recommend.",
    "Avatar": "https://www.gravatar.com/avatar/8cd582fed70eed5e84cdb87d780613af?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/solid-all-around-278905/",
    "Rating": "5 stars"
  },
  {
    "Position": "36",
    "User Name": "",
    "Date": "",
    "Title": "Ooh, Might Be Time to Ditch Elementor for Good",
    "Review": "After being wowed by MaxiBlocks' intuitive interface and huge library of pre-built blocks, I'm now seriously considering making the switch from Elementor. As an avid WordPress user, MaxiBlocks has won me over with its improvements.\n\nBut I'm really excited for what's next on MaxiBlocks' roadmap - I've heard rumors of a new theme in the works that has me even more eager to use it going forward. With MaxiBlocks' strong foundation and designer-focused features, their custom theme has the potential to truly elevate the page building experience to another level.\n\nIf it's as polished, customizable and developer-friendly as MaxiBlocks already is, this theme could catapult them to the stratosphere of top WordPress solutions. I can't wait to see what innovative features and design capabilities they come up with next.\n\nBetween the booming block library and lofty future plans, MaxiBlocks is setting the bar high. For those ready to take their website design to new heights, MaxiBlocks might just convince you it's time to ditch your old page builder for good. I know I'll be keeping a close eye on their progress!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/3fc8dd9f3008db03c24d4669f4db6577?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/ooh-might-be-time-to-ditch-elementor-fo-278607/",
    "Rating": "5 stars"
  },
  {
    "Position": "37",
    "User Name": "",
    "Date": "",
    "Title": "Customizing Gutenberg Just Got Easier with MaxiBlocks",
    "Review": "I made the transition to Gutenberg last year but found creating custom layouts to be challenging. While design patterns are a helpful addition, they have limitations. After testing several Gutenberg page builder solutions, I found MaxiBlocks to stand out for the following reasons:\n\n- Seamlessly integrates with Gutenberg editor\n- Provides an extensive library of professional templates\n- Intuitive interface simplifies site-building\n- Creative designs that are visually engaging\n- Powerful customization tools even for complex pages\n- Generous LTD\n\nThe number and creativity of the templates MaxiBlocks offers are impressive. The templates go beyond standard cookie-cutter designs with eye-catching styles. Beyond offering more template options, MaxiBlocks reimagines Gutenberg blocks for greater layout flexibility. The sophistication of the builder tools shows this is a mature, well-thought-out plugin focused on simplified site-building.\n\nFor those wanting complete control, MaxiBlocks empowers easy customization to realize your designs. An upcoming FSE theme release with full-page templates will further round out integration with Gutenberg. You can preview this on their site.\n\nMaxiBlocks hits all the right notes as a Gutenberg page builder plugin - creative templates, flexible blocks, and powerful customization in an easy-to-use package. The capabilities and generous pricing make it a compelling choice.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/restonian-2024.jpg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/customizing-gutenberg-just-got-easier-wi-277631/",
    "Rating": "5 stars"
  },
  {
    "Position": "38",
    "User Name": "",
    "Date": "",
    "Title": "Marcin",
    "Review": "I bought Maxi after receiving the bill for next year of Elementor...\nLibrary of pages, elements or icons is huge. As we can see at Questions page at Appsumo - support is very helpful.\nI'm building new pages in Maxi and didn't need to learn too much. It's simple and straightforward to do.\nHelp section and YouTube videos are fast and very condensed with information which I'm looking for. That speeds up the work.",
    "Avatar": "https://www.gravatar.com/avatar/d8279578ed6ac2dd30ec9619fcb1a7d5?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/marcin-277522/",
    "Rating": "5 stars"
  },
  {
    "Position": "39",
    "User Name": "",
    "Date": "",
    "Title": "A fantastic addition to the WP ecosystem - Make WordPress fun!",
    "Review": "This is such a great builder - and I have tried and bought many, including for AppSumo. Whilst I normally use Elementor for my sites, I have been looking for a tool that is user-friendly for beginners but also does not look clunky or behave like it was coded in the 80s, in particular for use in a WaaS. The fully functional plugin is available from the WordPress repository, the pro licences give you access to tons more templates in the cloud. The designs are pretty awesome and the tool itself is a 'joy' to use. In my opinion, it is more user-friendly than Elementor, Divi, and Stackable and it is up there with Brizy and Bricks. The agency licence is excellent value, the licencing model of 50 pro licences per time will also prevent licence abuse of this excellent tool.\n\nI did not rush into this purchase and I have read many of the reviews and watched many videos and interviews that Christiaan has done on YouTube, MaxiBlocks does not disappoint. I hope that it firmly establishes itself in the WordPress ecosystem. Finally, a tool that makes Gutenberg fun :)\n\nI expect that most beginners and WaaS users would prefer to build their site with this tool rather than something with a much longer learning curve than Elementor. As the product matures, I wonder if more and more seasoned WordPress developers will also 'see the light'! As mentioned earlier the plugin is free to download from the WordPress repository. Give it a go and if you like it - get this deal before it goes.\n\nThank you to Kyra and Christiaan for this wonderful creation, you should be really proud. I wish you both and MaxiBlocks all the very best for the future.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/vikas.JPG?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/a-fantastic-addition-to-the-wp-ecosystem-277396/",
    "Rating": "5 stars"
  },
  {
    "Position": "40",
    "User Name": "",
    "Date": "",
    "Title": "5 Tacos But Not For Me...Here's Why..",
    "Review": "I was excited to purchase MaxiBlocks, but my excitement turned swiftly to disappointment.\n\nNow, you probably wondering why, in view of the 5 tacos I've given them.\n\nI'm certain this is a solid product, you can see that from the other reviews and the responses from the founders. Just take a look at everything you get, at a reasonable LTD price. I believe it would be unfair to give them anything less than that.\n\nIt all comes down to an unsatisfactory experience. Let me explain my issue.\n\nNowhere could I see from the sales page, (Appsumo or the website) that you need to have WordPress php 8.0 or above to install the plug-in. If I had known this from the beginning, I wouldn't have purchased it. Maybe it is there (somewhere), but it isn't obvious. Consequently, my first installation failed. Not an auspicious start.\n\nI'm not very technical and don't like messing with PHP. The last time I did, I had a terrible experience, and my whole site crashed.\n\nAnyway, I contacted my host (who were brilliant) They kindly dealt with it.\n\nBut then things started to go wrong. This was because the upgrade to php 8.0 conflicted with other themes and plug-ins on my websites. Needless to say, I wasn't very happy, as it affected 6 of my websites!!\n\n2 Days later the issues are still not resolved. This seems like too much hard work, unnecessary stress, and wasted time on my part. So, inevitably, I will be refunding. This is a shame as I was looking forward to enjoying MaxiBlocks and becoming a real ambassador for them. Sadly, that's not going to happen now.\n\nI'm writing this to warn other potential buyers. Don't get me wrong, the product is probably first class, but I'm afraid I'll never get to find out.\n\nIf you are a techie, and PHP upgrades don't scare the living daylights out of you, then go ahead and consider MaxiBlocks, I'm certain you won't be disappointed.\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/pug.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/5-tacos-but-not-for-meheres-why-277337/",
    "Rating": "5 stars"
  },
  {
    "Position": "41",
    "User Name": "",
    "Date": "",
    "Title": "My new go-to design tool",
    "Review": "I have just began designing my first website using Maxi Blocks and I already feel like I can create lots of new designs using this tool. There are some really cool features that no other theme or drag and drop builder has. For instance the interaction designer is a cool feature that lets you design any kind of interaction, with any kind of elements.\n\nThe support also is very nice. I have had a question and I received a video tutorial on how to create what I was looking for. So thumbs up for Marco!\n\nNext, the current design library is pretty extensive already, with over 1800 pre made sections (which look so cool), it's easy to create a website.\n\nOh and there is a feature that absolutely no other tool has, which is some sort of styleguide creator. With this creator, you can set fonts, colours of icons, background, lines and all other elements. Then, all elements will be automatically created in your own styleguide.\n\nI can't wait for the Maxi theme to be released to create even more designs like blog pages, archives, header and footers.\n\nWhile there is a ltd, this deal is a no-brainer!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/7556fc91397129b59a97d17a543a66be?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/my-new-go-to-design-tool-275157/",
    "Rating": "5 stars"
  },
  {
    "Position": "42",
    "User Name": "",
    "Date": "",
    "Title": "A Game-Changer for WordPress Design",
    "Review": "I recently began using MaxiBlocks and, WOW! If you're involved in website development using WordPress, MaxiBlocks is an indispensable tool. Its blend of user-friendly design, exceptional support, and a comprehensive feature set makes it a standout choice in the realm of WordPress design tools.\n\nEase of Use:\nMaxiBlocks stands out with its intuitive interface. As someone who builds websites regularly, I found the learning curve manageable and well worth it, considering the plethora of features it offers.\n\nSupport Excellence:\nA major highlight for me was the exceptional customer support. Marko, a member of the support team, went above and beyond by not only providing prompt and effective solutions but also arranging a call to address my queries personally. This level of service is rare and highly appreciated.\n\nTemplates and Patterns:\nThe range of templates and patterns available in MaxiBlocks is impressive. They are not just abundant but also aesthetically pleasing, enabling quick and beautiful website construction. This variety can cater to various design preferences and website needs.\n\nFeature-Rich Platform:\nMaxiBlocks is a treasure trove of features. From basic design elements to advanced functionalities, it caters to both novice users and seasoned designers. This makes it a versatile tool suitable for a wide range of WordPress projects.\n\nFor anyone looking to enhance their WordPress design process, I highly recommend giving MaxiBlocks a try.\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/b1fb70cfff3f4ea7b9baba4e50cdf0e7?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/a-game-changer-for-wordpress-design-274810/",
    "Rating": "5 stars"
  },
  {
    "Position": "43",
    "User Name": "",
    "Date": "",
    "Title": "Dobra apka, ale...",
    "Review": "Fajnie się zapowiadała przygoda z tą aplikacją.\nCo tu dużo mówić byłem podekscytowany, że w końcu Wordpress stanie się łatwy w użytkowaniu.\nNiestety tak się nie stało.\n\nMaxiBlokcs do wygodnej pracy wymaga jednak MySQL w wersji 8.0 . Na moim hostingu jest 5.7 , która powoduje, że bloki nie ładują się poprawnie (wg supportu) .\nNie rezygnuję z zakupu bo wciąż mam nadzieję, że wszystko zadziała poprawie po aktualizacji serwera baz danych do Mariadb 10.6, bo taką wersję zapowiedział mój dostawca\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/669f742b982dbe1d2f14fe180efe9739?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/dobra-apka-ale-274697/",
    "Rating": "5 stars"
  },
  {
    "Position": "44",
    "User Name": "",
    "Date": "",
    "Title": "AMAZING SUPPORT AND PRODUCT!!!!!",
    "Review": "I can tell you how impressed I am, not only this product, but with the company. I had some questions on how to begin. Not only did I get answers right away, I got to spend nearly an hour on a Google chat with the founder to help guide me through the process. I have spent many times more for products and received much less attention. This is a no brainer fellow Sumolings. I can see this as my go to WP builder from here on out. If I could leave enough tacos to start a restaurant i would!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/richrogersheadshot.jpeg?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/amazing-support-and-product-274654/",
    "Rating": "5 stars"
  },
  {
    "Position": "45",
    "User Name": "",
    "Date": "",
    "Title": "Design tool on steroids",
    "Review": "Just tried out Maxiblocks, and wow, it's like Elementor Pro but on steroids! There's a slight learning curve, but it's super user-friendly, which is great for someone like me who wants things simple yet effective. It's packed with cool pre-made blocks and designs that will make your site look pro without the headache.\n\nAnd have to give a shoutout to Marko from support – this guy is on it!\n\nSo, if you're into making your WordPress site awesome without pulling your hair out, MaxiBlocks is the way to go. Total recommend!\n\nRead less",
    "Avatar": "https://www.gravatar.com/avatar/2a6bcee054e1d3b17e1c126f923dd5b2?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/design-tool-on-steroids-274374/",
    "Rating": "5 stars"
  },
  {
    "Position": "46",
    "User Name": "",
    "Date": "",
    "Title": "GREAT CUSTOMER SERVICE",
    "Review": "I've bought Maxiblocks not just for my website and clients but to get inspiration as well. I have been a web designer/developer for almost a year, I quickly needed help for styling and typography from them and received a good amount of support from Kyra. The plugin seems very easy to start working with once I get myself going. This was worth the money spent.",
    "Avatar": "https://www.gravatar.com/avatar/a4a6bcd5bbf3f839f505324a002a1b24?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-customer-service-274292/",
    "Rating": "5 stars"
  },
  {
    "Position": "47",
    "User Name": "",
    "Date": "",
    "Title": "Great Customer Service!",
    "Review": "I purchased Maxiblocks for its well-designed templates. Unfortunately, I was unable to install the pro version locally or on Cloudways.\nHowever, I experimented enough with the free templates to know that it is a good product. They also boast top-notch customer service with a quick response time. Christiaan spent hours with me trying to fix the issue.\nDespite the problem, I decided to keep Maxiblocks.",
    "Avatar": "https://www.gravatar.com/avatar/be334d9c37d51bf623d70ad2de92d8a2?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-customer-service-274233/",
    "Rating": "5 stars"
  },
  {
    "Position": "48",
    "User Name": "",
    "Date": "",
    "Title": "GREAT CUSTOMER SERVICE",
    "Review": "I've bought the tool for my website relaunch. Not really a professional web designer, I quickly needed help from MB - and received great support from Kyra.\nThe plugin seems very easy to start working with and I am looking forward to relaunching my website with it",
    "Avatar": "https://www.gravatar.com/avatar/dada27db79feb18e1c163923052e073e?s=100&d=mm",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/great-customer-service-273936/",
    "Rating": "5 stars"
  },
  {
    "Position": "49",
    "User Name": "",
    "Date": "",
    "Title": "AWESOME page builder tool! If looking, highly recommend",
    "Review": "MaxiBlocks has exceeded all my expectations, earning a solid 5+ Star rating from me. As a former Divi user, I was pleasantly surprised by MaxiBlocks' intuitive learning curve, making WordPress web design more responsive and a breeze. It's a neat and cool tool that has rekindled my passion for design.\n\nDiscovering MaxiBlocks as a Lifetime deal was a truly divine blessing, and I can't wait to explore its full potential and eagerly anticipate future updates. The icing on the cake is the remarkable support team – they're incredibly responsive, addressing questions and concerns promptly.\n\nIn summary, MaxiBlocks is a must-have for WordPress web designers, offering a delightful and productive experience. It's not just a tool; it's a transformative design journey. Kudos to the MaxiBlocks team for creating a remarkable platform that has left me thoroughly impressed!\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/FI_Logo_650x650v2.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/awesome-page-builder-tool-if-looking-h-273766/",
    "Rating": "5 stars"
  },
  {
    "Position": "50",
    "User Name": "",
    "Date": "",
    "Title": "Any word for yes is LOW!",
    "Review": "It is not easy to find words that fully convey our impressions of the MaxiBlocks product and its developers. Any attempt to describe their achievements seems inadequate, and their product, compared to other solutions for Gutenberg available on the market, is simply incomparable in terms of usability, design and visual appeal.\n\nMaxiBlocks is a product that pushes the boundaries of what we consider standard. Anything we can add to that description seems inadequate. But is it worth investing in this product? The answer is definitely yes!\n\nThe support from the MaxiBlocks team, especially from Kyra and Marko, sets a new standard of professionalism. Their commitment and level of customer service are at a level unavailable to others at this time.\n\nWe are not here to unjustifiably praise the product or the team - MaxiBlocks and its developers have worked hard for their success. If we could award 100 stars, they would honestly receive them both as a team and as a product.\n\nNow get ready for something really big. MaxiBlocks has announced something they describe as \"EPIC\". What can we expect? We don't know that yet, but it will definitely be something that will exceed our wildest expectations.\n\nI recommend MaxiBlocks to anyone who appreciates quality, innovation and professionalism. Every user will be satisfied and delighted with the product, its options, quality of workmanship and, above all, technical support.\n\nMaxiBlocks is an innovative product for Gutenberg that stands out from the competition in terms of usability, design and visual appeal. A team of professionals who constantly strive for excellence and set new standards in the industry is responsible for its creation.\n\nI encourage all AdAlbert\n\nRead less",
    "Avatar": "https://appsumo2-cdn.appsumo.com/media/users/avatars/Logo-NANOQUICK-IKONA_2000.png?width=150",
    "Review Link": "https://appsumo.com/products/maxiblocks/reviews/any-word-for-yes-is-low-273765/",
    "Rating": "5 stars"
  }
]